/**
    \file
    \brief Заголовочный файл с различными помощями для пользователя
    В данном файле выведены все заголовки функций, реализующие подсказки для работы с проектом
*/
#pragma once
#ifdef __WIN32__
#include "help_Windows.cpp"
#endif // __WIN32__

#ifdef __linux__
#include "help_Linux.cpp"
#endif // __linux__

/**
    \brief Функция выводящая подсказку при неправильном запуске программы
*/
void print_help();
/**
    \brief Функция, выводящая все возможные номера шифров
*/
void helpWithCipherNumbers();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.1.1
*/
void help_1_1_1();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.1.2
*/
void help_1_1_2();

/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.2.1
*/
void help_1_2_1();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.2.2
*/
void help_1_2_2();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.2.3
*/
void help_1_2_3();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.2.4
*/
void help_1_2_4();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.2.5
*/
void help_1_2_5();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.2.6
*/
void help_1_2_6();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.2.7
*/
void help_1_2_7();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.2.8
*/
void help_1_2_8();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.2.9
*/
void help_1_2_9();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.2.10
*/
void help_1_2_10();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.2.11
*/
void help_1_2_11();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.2.12
*/
void help_1_2_12();

/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.3.1
*/
void help_1_3_1();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.3.2
*/
void help_1_3_2();

/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.4.1
*/
void help_1_4_1();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.4.2
*/
void help_1_4_2();

/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.5.1
*/
void help_1_5_1();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.5.2
*/
void help_1_5_2();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.5.3
*/
void help_1_5_3();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.5.4
*/
void help_1_5_4();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.5.5
*/
void help_1_5_5();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.5.6
*/
void help_1_5_6();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.5.7
*/
void help_1_5_7();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.5.8
*/
void help_1_5_8();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.5.9
*/
void help_1_5_9();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.5.10
*/
void help_1_5_10();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.5.11
*/
void help_1_5_11();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.5.12
*/
void help_1_5_12();

/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.1.1
*/
void help_1_6_1_1();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.1.2
*/
void help_1_6_1_2();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.1.3
*/
void help_1_6_1_3();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.1.4
*/
void help_1_6_1_4();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.1.5
*/
void help_1_6_1_5();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.1.6
*/
void help_1_6_1_6();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.1.7
*/
void help_1_6_1_7();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.1.8
*/
void help_1_6_1_8();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.1.9
*/
void help_1_6_1_9();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.1.10
*/
void help_1_6_1_10();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.1.11
*/
void help_1_6_1_11();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.1.12
*/
void help_1_6_1_12();

/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.2.1
*/
void help_1_6_2_1();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.2.2
*/
void help_1_6_2_2();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.2.3
*/
void help_1_6_2_3();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.2.4
*/
void help_1_6_2_4();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.2.5
*/
void help_1_6_2_5();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.2.6
*/
void help_1_6_2_6();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.2.7
*/
void help_1_6_2_7();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.2.8
*/
void help_1_6_2_8();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.2.9
*/
void help_1_6_2_9();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.2.10
*/
void help_1_6_2_10();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.2.11
*/
void help_1_6_2_11();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.6.2.12
*/
void help_1_6_2_12();

/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.7.1
*/
void help_1_7_1();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.7.2
*/
void help_1_7_2();

/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.1.1
*/
void help_1_8_1_1();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.1.2
*/
void help_1_8_1_2();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.1.3
*/
void help_1_8_1_3();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.1.4
*/
void help_1_8_1_4();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.1.5
*/
void help_1_8_1_5();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.1.6
*/
void help_1_8_1_6();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.1.7
*/
void help_1_8_1_7();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.1.8
*/
void help_1_8_1_8();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.1.9
*/
void help_1_8_1_9();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.1.10
*/
void help_1_8_1_10();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.1.11
*/
void help_1_8_1_11();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.1.12
*/
void help_1_8_1_12();

/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.2.1
*/
void help_1_8_2_1();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.2.2
*/
void help_1_8_2_2();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.2.3
*/
void help_1_8_2_3();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.2.4
*/
void help_1_8_2_4();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.2.5
*/
void help_1_8_2_5();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.2.6
*/
void help_1_8_2_6();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.2.7
*/
void help_1_8_2_7();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.2.8
*/
void help_1_8_2_8();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.2.9
*/
void help_1_8_2_9();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.2.10
*/
void help_1_8_2_10();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.2.11
*/
void help_1_8_2_11();
/**
    \brief Функция, выводящая подробное описание работы шифра под номером 1.8.2.12
*/
void help_1_8_2_12();

